<template>
  <div>
    <!-- 折叠框 -->
    <div class="zdk">
      <!-- 标题 -->
      <div class="zdk-title">
        <svg
          t="1585115706828"
          class="icon"
          viewBox="0 0 1024 1024"
          version="1.1"
          xmlns="http://www.w3.org/2000/svg"
          p-id="1514"
          width="16"
          height="16"
          v-if="location"
        >
          <path
            d="M512 231.1c30.9 0 60 12.1 81.9 33.9 21.9 21.9 33.9 50.9 33.9 81.8s-12.1 60-33.9 81.8c-21.9 22-50.9 34.1-81.9 34.1-30.9 0-60-12.1-81.8-33.9-21.9-21.9-33.9-50.9-33.9-81.8s12.1-60 33.9-81.8c21.9-22 51-34.1 81.8-34.1m0-63.9c-99.2 0-179.7 80.5-179.7 179.7S412.9 526.6 512 526.6s179.7-80.5 179.7-179.7S611.3 167.2 512 167.2z"
            fill="#d81e06"
            p-id="1515"
          />
          <path
            d="M512 64.6c38.1 0 75.1 7.5 109.8 22.2 33.5 14.2 63.7 34.5 89.6 60.5 26 25.9 46.3 56.2 60.5 89.8 14.8 34.8 22.3 71.8 22.4 110 0.1 56.6-15.6 118.2-46.8 183-26.3 54.4-63.2 110.9-109.9 168-46.4 56.8-93.5 102.8-125.5 132.1-31.3-28.7-77.2-74-123.1-130.1-46.9-57.3-84.2-114.2-110.9-168.9-31.8-65.4-48.1-127.5-48.5-184.6-0.3-37.7 7-74.4 21.4-108.9 14-33.3 34.1-63.4 59.8-89.3 26.1-26.3 56.5-46.8 90.3-61.3 35.3-14.9 72.6-22.5 110.9-22.5m0-63.9c-191.1 0-347.5 155-346.2 346.2 2 292.5 346.2 567.7 346.2 567.7s347-275.2 346.2-567.7C857.8 155.8 703.3 0.7 512 0.7z"
            fill="#d81e06"
            p-id="1516"
          />
          <path
            d="M512.3 1022.8c-79.3 0-154.3-13.6-211.3-38.1-65.5-28.2-101.5-69.2-101.5-115.1 0-26.4 12.1-64.9 69.4-98.8 1.5-0.9 3-1.7 4.5-2.6 5.7-3.2 11.7-6.3 17.9-9.2 16-7.6 35-0.7 42.5 15.2 7.6 16 0.7 35-15.2 42.5-4.8 2.3-9.5 4.7-13.8 7.1-1.1 0.6-2.2 1.3-3.3 1.9-24.2 14.4-38 30.3-38 43.8 0 18.1 24.2 39.6 63 56.4 49.1 21.3 115.2 32.9 186 32.9s136.8-11.7 186-32.9c38.8-16.8 63-38.4 63-56.4 0-13.6-14-29.6-38.3-44-5.2-3-10.8-6-16.8-8.9-16-7.6-22.8-26.6-15.2-42.5 7.6-16 26.6-22.8 42.5-15.2 7.7 3.7 15.1 7.6 22 11.6 57.6 34 69.8 72.7 69.8 99 0 45.9-36 86.8-101.5 115.1-57.4 24.6-132.2 38.2-211.7 38.2z"
            fill="#d81e06"
            p-id="1517"
          />
        </svg>
        {{title}}
        <svg
          t="1585128684481"
          class="icon"
          viewBox="0 0 1024 1024"
          version="1.1"
          xmlns="http://www.w3.org/2000/svg"
          p-id="2220"
          width="8"
          height="8"
          v-if="arrow"
        >
          <path
            d="M959.429379 343.214852 890.590548 274.378068 511.268336 653.699256 131.944078 274.378068 63.105247 343.214852 501.1857 781.294282 521.348925 781.294282Z"
            p-id="2221"
            fill="#515151"
          />
        </svg>
      </div>
      <!-- 内容 -->
      <div class="zdk-content">
        <slot></slot>
      </div>
    </div>
  </div>
</template>
<script>
export default {
  // 定义属性
  props: {
    // 是否显示位置图标
    location: {
      type: Boolean,
      default: false //默认
    },
    title: {
      type: String,
      required: true //是否必填
    },
    // 图标是否显示
    arrow: {
      type: Boolean,
      default: false
    }
  }
};
</script>
<style lang="scss">
// 折叠框
.zdk {
  display: inline-block;
  &:hover {
    .zdk-title {
      background-color: #fff;
      border-color: #ccc;
      position: relative;
      &::after {
        content: "";
        width: 100%;
        height: 1px;
        background-color: #fff;
        display: block;
        position: absolute;
        z-index: 99999;
        left: 0;
      }
    }
    .zdk-content {
      display: block;
    }
  }
  &-title {
    height: 30px;
    line-height: 30px;
    padding: 0 10px;
    border-left: 1px solid transparent;
    border-right: 1px solid transparent;
  }
  &-content {
    background-color: #fff;
    border: 1px solid #eee;
    padding: 10px;
    display: none;
    position: absolute;
  }
}
</style>